In [ ]:
what is pandas?
*data manipulation and analysis 
*data mining library built on python

#pip install pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

In [ ]:
#pip install --upgrade pandas --user

In [4]:
s1=pd.Series([1,2,3,4,'five'],index=['a','b','c','d','e']),

In [5]:
print(s1)

(a       1
b       2
c       3
d       4
e    five
dtype: object,)

In [6]:
s2=pd.Series(["python","R","c++","html","java"],index=[1,2,3,4,5])

In [7]:
print(s2)

1    python
2         R
3       c++
4      html
5      java
dtype: object

# data frame

varible_name=pd.DataFrame(data,column=[column name])

In [8]:
df1=pd.DataFrame(s2,columns=["language"])

In [9]:
df1

  language
1   python
2        R
3      c++
4     html
5     java

In [11]:
Fruits={"seed":{1:"orange",2:"Apple",3:"Watermelon"},"seedless":{1:"pineapple",2:"grapes",3:"pappya"}}

In [14]:
df2=pd.DataFrame(Fruits,columns=["seed","seedless"])

In [15]:
df2

         seed   seedless
1      orange  pineapple
2       Apple     grapes
3  Watermelon     pappya

CReate a dataframe for your class,containing "name",regno,year of study as columns name for ten students

In [16]:
Student={"name":{1:"sana",2:"sara",3:"yelena",4:"hana",5:"jeni"},"reg no":{1:"501",2:"502",3:"503",4:"504",5:"505"},"year":{1:"thirdyear",2:"thirdyear",3:"thirdyear",4:"thirdyear",5:"thirdyear"}}

In [17]:
df2=pd.DataFrame(Student,columns=["name","reg no","year"])

In [18]:
df2

     name reg no       year
1    sana    501  thirdyear
2    sara    502  thirdyear
3  yelena    503  thirdyear
4    hana    504  thirdyear
5    jeni    505  thirdyear

In [20]:
Student=df2["name"]

In [21]:
df2.drop("name",axis=1)

  reg no       year
1    501  thirdyear
2    502  thirdyear
3    503  thirdyear
4    504  thirdyear
5    505  thirdyear